Revit 2027 API
RenderingQualitySettings.RenderingQuality Property
 The quality applied for rendering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RenderingQuality RenderingQuality { get; set; }
Public Property RenderingQuality As RenderingQuality
	Get
	Set
public:
property RenderingQuality RenderingQuality {
	RenderingQuality get ();
	void set (RenderingQuality value);
}
member RenderingQuality : RenderingQuality with get, set
Property Value
RenderingQuality
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace